config.org
#+TITLE: config

* General
** Enable line wrapping
#+BEGIN_SRC emacs-lisp
(setq truncate-lines 'nil)
#+END_SRC

** TAB always indent current line
#+BEGIN_SRC emacs-lisp
(setq tab-always-indent t)
#+END_SRC

** Always use Utf-8
#+BEGIN_SRC emacs-lisp
(prefer-coding-system 'utf-8)
#+END_SRC

** Movements
*** Make evil mode up/down operate in screen lines instead of logical
#+BEGIN_SRC emacs-lisp
(define-key evil-motion-state-map "j" 'evil-next-visual-line)
(define-key evil-motion-state-map "k" 'evil-previous-visual-line)
(define-key evil-visual-state-map "j" 'evil-next-visual-line)
(define-key evil-visual-state-map "k" 'evil-previous-visual-line)
#+END_SRC

*** Move line under cursor
#+BEGIN_SRC emacs-lisp
(define-key evil-normal-state-map (kbd "C-j") 'move-text-down)
(define-key evil-normal-state-map (kbd "C-k") 'move-text-up)
#+END_SRC

#+RESULTS:
: move-text-up
** eShell
#+BEGIN_SRC emacs-lisp
(map! :leader "o e" #'projectile-run-eshell)
#+END_SRC

* Major modes
** Elixir
Better formating for test output buffers
#+BEGIN_SRC emacs-lisp
(setq alchemist-test-truncate-lines nil)
(set-popup-rule! "^\\*alchemist test report" :size 0.4 :select nil :quit nil :ttl 0 :side 'bottom)
(setq compilation-scroll-output t)
#+END_SRC

Use web-mode for eex files
#+BEGIN_SRC emacs-lisp
(add-to-list 'auto-mode-alist '("\\.?eex?\\'" . web-mode))
#+END_SRC

** Web mode
#+BEGIN_SRC emacs-lisp
(setq web-mode-markup-indent-offset 2
      web-mode-code-indent-offset 2
      web-mode-css-indent-offset 2
      js-indent-level 2
      json-reformat:indent-width 2
      css-indent-offset 2)
#+END_SRC

* Clean it up
#+BEGIN_SRC emacs-lisp
(setq
 doom-font (font-spec :family "Source Code Pro" :size 20)
 doom-big-font (font-spec :family "Source Code Pro" :size 20)
 doom-variable-pitch-font (font-spec :family "Source Code Pro" :size 20)
 doom-theme 'doom-gruvbox)
#+END_SRC

* Toogle 2 windows layout (SPC l +)
#+BEGIN_SRC emacs-lisp
(defun spacemacs/window-layout-toggle ()
  "Toggle between horizontal and vertical layout of two windows."
  (interactive)
  (if (= (count-windows) 2)
    (let* ((window-tree (car (window-tree)))
           (current-split-vertical-p (car window-tree))
           (first-window (nth 2 window-tree))
           (second-window (nth 3 window-tree))
           (second-window-state (window-state-get second-window))
           (splitter (if current-split-vertical-p
                         #'split-window-horizontally
                       #'split-window-vertically)))
      (delete-other-windows first-window)
      ;; `window-state-put' also re-selects the window if needed, so we don't
      ;; need to call `select-window'
      (window-state-put second-window-state (funcall splitter)))
    (error "Can't toggle window layout when the number of windows isn't two.")))

;; Place your private configuration here
(map! :n "SPC l +" #'spacemacs/window-layout-toggle)
#+END_SRC
